content/posts/The_pragmatic_turn_by_Richard_Bernstein_in_2010.md
+++
title = "The pragmatic turn by Richard Bernstein in 2010"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:36:15-04:00
slug = "The_pragmatic_turn_by_Richard_Bernstein_in_2010"
draft = false
+++

## 0. Preface {#0-dot-preface}


### introduction {#introduction}

<!--list-separator-->

-  on August 26th 1898 William James gave a talk at the philosophical union of the University of California at Berkeley he introduced pragmatism in his talk titled "philosophical conceptions and practical results"

<!--list-separator-->

-  when James tells us that he heard the principle of pragmatism enunciated in the 1870s he is referring to meetings of the metaphysical club and he specifically refers to Peirce's now famous 1878 paper "How to make our ideas clear"

<!--list-separator-->

-  Peirce's pragmatic maxim

    <!--list-separator-->

    -  consider what effects, which might conceivably have practical bearings, we conceive the object of our conception to have. then our conception of these effects is the whole of our conception of the object

<!--list-separator-->

-


### the cultural context {#the-cultural-context}


### The historical vicissitudes of pragmatism {#the-historical-vicissitudes-of-pragmatism}


### the global reach of pragmatism {#the-global-reach-of-pragmatism}


### The German appropriation of pragmatic themes {#the-german-appropriation-of-pragmatic-themes}


### My intellectual journey with pragmatism {#my-intellectual-journey-with-pragmatism}


## 1. Charles S. Peirce's critique of cartesianism {#1-dot-charles-s-dot-peirce-s-critique-of-cartesianism}


### “Questions Concerning Certain Faculties Claimed for Man”; “Some Consequences of Four Incapacities”; and “Grounds of Validity of the Laws of Logic.” These articles, known as the “Cognition Series” are reprinted in Peirce 1992, pp. 11–82.” {#questions-concerning-certain-faculties-claimed-for-man-some-consequences-of-four-incapacities-and-grounds-of-validity-of-the-laws-of-logic-dot-these-articles-known-as-the-cognition-series-are-reprinted-in-peirce-1992-pp-dot-11-82-dot}


### Peirce proceeds to list four contrasts between Cartesianism and scholasticism. He declares that, “without wishing to return to scholasticism, it seems to me that modern science and logic require us to stand upon a different platform from this” (ibid.). Here I will examine Peirce’s explication of his four critical points about the inadequacies of Cartesianism. {#peirce-proceeds-to-list-four-contrasts-between-cartesianism-and-scholasticism-dot-he-declares-that-without-wishing-to-return-to-scholasticism-it-seems-to-me-that-modern-science-and-logic-require-us-to-stand-upon-a-different-platform-from-this--ibid-dot--dot-here-i-will-examine-peirce-s-explication-of-his-four-critical-points-about-the-inadequacies-of-cartesianism-dot}


### “ There are beliefs that we take to be certain and indubitable. Our commonsense view is that there are numerous beliefs that we do not doubt and that provide “the bedrock of truth.” But Peirce’s commonsensism is a ****critical**** commonsensism. What is ****indubitable**** is not to be identified with what is ****incorrigible****. As Peirce tells us, “what has been indubitable one day has often been proved on the morrow to be false” (5.514).5 We never escape from the situation of starting from some beliefs (prejudices and prejudgments) that we take to be indubitable. In this sense we can speak of a foundation from which any inquiry begins. {#there-are-beliefs-that-we-take-to-be-certain-and-indubitable-dot-our-commonsense-view-is-that-there-are-numerous-beliefs-that-we-do-not-doubt-and-that-provide-the-bedrock-of-truth-dot-but-peirce-s-commonsensism-is-a-critical-commonsensism-dot-what-is-indubitable-is-not-to-be-identified-with-what-is-incorrigible-dot-as-peirce-tells-us-what-has-been-indubitable-one-day-has-often-been-proved-on-the-morrow-to-be-false--5-dot-514--dot-5-we-never-escape-from-the-situation-of-starting-from-some-beliefs--prejudices-and-prejudgments--that-we-take-to-be-indubitable-dot-in-this-sense-we-can-speak-of-a-foundation-from-which-any-inquiry-begins-dot}


### Peirce’s point is subtle and important. ****He is an anti-foundationalist when foundationalism is understood as the doctrine that claims that there are basic or incorrigible truths that are not subject to revision.**** But he is not denying – indeed, he is affirming – that ****all knowing has a foundation in the sense that there are tacitly held beliefs, which we don’t doubt and take to be the bedrock of truth.**** {#peirce-s-point-is-subtle-and-important-dot-he-is-an-anti-foundationalist-when-foundationalism-is-understood-as-the-doctrine-that-claims-that-there-are-basic-or-incorrigible-truths-that-are-not-subject-to-revision-dot-but-he-is-not-denying-indeed-he-is-affirming-that-all-knowing-has-a-foundation-in-the-sense-that-there-are-tacitly-held-beliefs-which-we-don-t-doubt-and-take-to-be-the-bedrock-of-truth-dot}


### Peirce would certainly endorse Wilfrid Sellars’s famous remark: “For empirical knowledge, like its sophisticated extension ****science, is rational, not because it has a foundation****, but ****because it is a self-correcting enterprise**** which can put any claim in jeopardy, though not all at once” (Sellars 1997, p. 79).” {#peirce-would-certainly-endorse-wilfrid-sellars-s-famous-remark-for-empirical-knowledge-like-its-sophisticated-extension-science-is-rational-not-because-it-has-a-foundation-but-because-it-is-a-self-correcting-enterprise-which-can-put-any-claim-in-jeopardy-though-not-all-at-once--sellars-1997-p-dot-79--dot}


### “In “How to Make Our Ideas Clear” Peirce declares: “The essence of belief is the establishment of a habit, and different beliefs are distinguished by the different modes of action to which they give rise” (Peirce 1992, pp. 129–30).” {#in-how-to-make-our-ideas-clear-peirce-declares-the-essence-of-belief-is-the-establishment-of-a-habit-and-different-beliefs-are-distinguished-by-the-different-modes-of-action-to-which-they-give-rise--peirce-1992-pp-dot-129-30--dot}


### “Consider what effects, which might conceivably have practical bearings, we conceive the object of our conception to have. Then our conception of these effects is the whole of our conception of the object” (Peirce 1992, p. 132).” {#consider-what-effects-which-might-conceivably-have-practical-bearings-we-conceive-the-object-of-our-conception-to-have-dot-then-our-conception-of-these-effects-is-the-whole-of-our-conception-of-the-object--peirce-1992-p-dot-132--dot}


## 2. The ethical consequences of William James's pragmatic pluralism {#2-dot-the-ethical-consequences-of-william-james-s-pragmatic-pluralism}


## 3. John Dewey's vision of radical democracy {#3-dot-john-dewey-s-vision-of-radical-democracy}


## 4. Hegel and pragmatism {#4-dot-hegel-and-pragmatism}


## 5. Pragmatism, objectivity, and truth {#5-dot-pragmatism-objectivity-and-truth}


## 6. Experience after the linguistic turn {#6-dot-experience-after-the-linguistic-turn}


## 7. Hilary Putnam: The entanglement of fact and value {#7-dot-hilary-putnam-the-entanglement-of-fact-and-value}


### 7.1 The context of Putnam's thesis {#7-dot-1-the-context-of-putnam-s-thesis}


### 7.2 Cognitive values {#7-dot-2-cognitive-values}


### 7.3 Ethical and political values {#7-dot-3-ethical-and-political-values}


### 7.4 Moral objectivity {#7-dot-4-moral-objectivity}


## 8. [Jurgen Habermas]({{< relref "Jurgen_Habermas" >}})'s Kantian pragmatism {#8-dot-jurgen-habermas--jurgen-habermas-dot-md--s-kantian-pragmatism}


### 8.1 Kant detranscendentalized {#8-dot-1-kant-detranscendentalized}


### 8.2 The epistemic normative rightness {#8-dot-2-the-epistemic-normative-rightness}


### 8.3 Neither contextualism nor idealism {#8-dot-3-neither-contextualism-nor-idealism}


### 8.4 Moral rightness {#8-dot-4-moral-rightness}


### 8.5 Action and discourse {#8-dot-5-action-and-discourse}


### 8.6 Moral constructivism and epistemological realism {#8-dot-6-moral-constructivism-and-epistemological-realism}


### 8.7 Janus-Faced truth? {#8-dot-7-janus-faced-truth}


### 8.8 Moral constructivism again {#8-dot-8-moral-constructivism-again}


### 8.9 Why Habermas rejects moral realism {#8-dot-9-why-habermas-rejects-moral-realism}


## 9. [Richard Rorty]({{< relref "Richard_Rorty" >}})'s deep humanism {#9-dot-richard-rorty--richard-rorty-dot-md--s-deep-humanism}


### 9.1 Rorty's early metaphysical explorations {#9-dot-1-rorty-s-early-metaphysical-explorations}


### 9.2 The linguistic turn {#9-dot-2-the-linguistic-turn}


### 9.3 Doubts about analytic philosophy {#9-dot-3-doubts-about-analytic-philosophy}


### 9.4 Public liberalism and private irony {#9-dot-4-public-liberalism-and-private-irony}


### 9.5 Rorty's humanism {#9-dot-5-rorty-s-humanism}


### 9.6 Some doubts about Rorty's humanism {#9-dot-6-some-doubts-about-rorty-s-humanism}
